Repository: mustafaots/Mobile-Dev-Project
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Easy Vacation
ar: عطلة سهلة

# welcomeMessage
source: Welcome, Traveler
ar: مرحبًا، أيها المسافر

# your_perfect_gateway
source: Your perfect getaway
ar: وجهتك المثالية

# discrover_places
source: Discover amazing places and create unforgettable memories with our travel platform.
ar: اكتشف أماكن مذهلة وصنع ذكريات لا تُنسى مع منصّة السفر الخاصة بنا.

# exploreMessage
source: Explore Now
ar: استكشف الآن

# createAccountTitle
source: Create Your Account
ar: إنشاء حسابك

# joinMessage
source: Join EasyVacation today
ar: انضم إلى EasyVacation اليوم

source: Full Name
ar: الاسم الكامل

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

# pleaseEnterFullName
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

# pleaseEnterFirstName
source: Please enter your first name
ar: يرجى إدخال اسمك الأول

# pleaseEnterLastName
source: Please enter your last name
ar: يرجى إدخال اسم عائلتك

# emailAlreadyExists
source: This email is already registered
ar: هذا البريد الإلكتروني مسجل بالفعل

# pleaseEnterEmail
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

# invalidPhoneFormat
source: Phone must start with 05, 06, or 07 followed by 8 digits
ar: يجب أن يبدأ الرقم بـ 05 أو 06 أو 07 متبوعًا بـ 8 أرقام

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Sign Up
ar: إنشاء حساب

# registrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.

# loginFailed
source: Login failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بياناتك.

# noInternetConnection
source: No internet connection. Please try again later.
ar: لا يوجد اتصال بالإنترنت. يرجى المحاولة لاحقا.

# alreadyHaveAccount
source: Already have an account? Login
ar: هل لديك حساب بالفعل؟ تسجيل الدخول

source: Or Continue With
ar: أو المتابعة عبر

source: Welcome Back
ar: مرحبًا بعودتك

# loginToAccount
source: Login to your account
ar: تسجيل الدخول إلى حسابك

source: Phone Or Email
ar: الهاتف أو البريد الإلكتروني

# pleaseEnterPhoneOrEmail
source: Please enter your phone/email
ar: يرجى إدخال هاتفك/بريدك الإلكتروني

source: Login
ar: تسجيل الدخول

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ إنشاء حساب

source: Home
ar: الرئيسية

source: Search...
ar: ابحث...

# filterWilaya
source: Wilaya
ar: الولاية

# filterPrice
source: Price
ar: السعر

# filterDate
source: Date
ar: التاريخ

# filterType
source: Type
ar: النوع

# tabStays
source: Stays
ar: الإقامات

# tabVehicles
source: Vehicles
ar: المركبات

# tabActivities
source: Activities
ar: الأنشطة

source: Settings
ar: الإعدادات

source: Account Settings
ar: إعدادات الحساب

source: Premium Member
ar: عضو بريميوم

source: Premium Subscription
ar: الاشتراك البريميوم

source: Monthly plan - Active
ar: الخطة الشهرية - مفعّلة

source: Active
ar: نشط

source: Edit Profile
ar: تعديل الملف الشخصي

# editProfileSubtitle
source: Update your personal information
ar: حدّث معلوماتك الشخصية

source: My Listings
ar: إعلاناتي

# myListingsSubtitle
source: View and manage your listings
ar: عرض وإدارة إعلاناتك

source: Booking History
ar: سجل الحجوزات

# bookingHistorySubtitle
source: View your past and upcoming bookings
ar: عرض حجوزاتك السابقة والقادمة

source: Subscription
ar: الاشتراك

# subscriptionSubtitle
source: Manage your subscription plan
ar: إدارة خطة اشتراكك

source: Blocked Users
ar: المستخدمون المحجوبون

# blockedUsersSubtitle
source: See who you blocked and want to unblock
ar: عرض المستخدمين الذين قمت بحجبهم وإلغاء الحجب

source: Sign Out
ar: تسجيل الخروج

# signOutSubtitle
source: Sign out of your account
ar: تسجيل الخروج من الحساب

# vehicles_featured_title
source: Featured Vehicles
ar: مركبات مميزة

# recommended_title
source: Recommended for You
ar: موصى بها لك

source: Load More
ar: تحميل المزيد

source: day
ar: يوم

# stays_featured_title
source: Featured Stays
ar: إقامات مميزة

source: night
ar: ليلة

# activities_featured_title
source: Featured Activities
ar: أنشطة مميزة

# subscriptions_title
source: Subscriptions
ar: الاشتراكات

# plan_recommended_label
source: Recommended
ar: موصى به

# plan_current_button
source: Current Plan
ar: الخطة الحالية

# plan_select_button
source: Select Plan
ar: اختر الخطة

# plan_free
source: Free
ar: مجاني

# plan_monthly
source: Monthly
ar: شهري

# plan_yearly
source: Yearly
ar: سنوي

# plan_detail_pay_per_cost
source: Pay-per-cost
ar: الدفع حسب التكلفة

# plan_detail_limited_uploads
source: Limited photo uploads
ar: تحميل صور محدود

# plan_detail_unlimited_listings
source: Unlimited listings
ar: إعلانات غير محدودة

# plan_detail_increased_visibility
source: Increased visibility
ar: زيادة الظهور

# plan_detail_monthly_benefits
source: All Monthly benefits
ar: كل مزايا الشهري

# plan_detail_top_placement
source: Top placement
ar: أعلى ترتيب

# plan_detail_special_badges
source: Special badges
ar: شارات خاصة

# languageTitle
source: Language
ar: اللغة

# appBar_createListing
source: Create Listing
ar: إنشاء إعلان

# header_createNewListing
source: Create New Listing
ar: إنشاء إعلان جديد

# header_fillDetails
source: Fill in the details to get started
ar: املأ التفاصيل للبدء

# photo_addPhotos
source: Add Photos
ar: إضافة صور

# photo_addPhotosDescription
source: Add up to 10 photos to showcase your listing
ar: أضف حتى 10 صور لعرض إعلانك

# photo_addPhotosButton
source: Add Photos
ar: إضافة صور

# listingType_title
source: Listing Type
ar: نوع الإعلان

# listingType_stay
source: Stay
ar: إقامة

# listingType_activity
source: Activity
ar: نشاط

# listingType_vehicle
source: Vehicle
ar: مركبة

# form_listingDetails
source: Listing Details
ar: تفاصيل الإعلان

# field_title
source: Title
ar: العنوان

# field_title_error
source: Please add a title
ar: يرجى إضافة عنوان

# field_description
source: Description
ar: الوصف

# field_description_error
source: Please add a description
ar: يرجى إضافة وصف

# field_price
source: Price
ar: السعر

# field_price_error
source: Please add a price
ar: يرجى إضافة سعر

# field_location
source: Location
ar: الموقع

# field_location_error
source: Please pin a location
ar: يرجى تحديد موقع

# button_continueToPayment
source: Continue To Payment
ar: المتابعة للدفع

# bottomNav_home
source: Home
ar: الرئيسية

# bottomNav_bookings
source: Bookings
ar: الحجوزات

# bottomNav_notifications
source: Notifications
ar: الإشعارات

# bottomNav_settings
source: Settings
ar: الإعدادات

# profile_title
source: Profile
ar: الملف الشخصي

# profile_posts
source: Posts
ar: المشاركات

# profile_followers
source: Followers
ar: المتابعون

# profile_reviews
source: Reviews
ar: التقييمات

# profile_noPostsYet
source: No posts yet
ar: لا توجد مشاركات بعد

# profile_noReviewsYet
source: No reviews yet
ar: لا توجد تقييمات بعد

# profile_follow
source: Follow
ar: متابعة

# profile_following
source: Following
ar: متابَع

# profile_about
source: About
ar: حول

# profile_from
source: From
ar: من

# profile_memberSince
source: Member since
ar: عضو منذ

# profile_countriesVisited
source: Countries visited
ar: الدول التي تم زيارتها

# profile_reportUser
source: Report User
ar: الإبلاغ عن المستخدم

# profile_blockUser
source: Block User
ar: حظر المستخدم

# profile_shareProfile
source: Share Profile
ar: مشاركة الملف الشخصي

# profile_cancel
source: Cancel
ar: إلغاء

# profile_helpful
source: Helpful
ar: مفيد

# bookings_title
source: Bookings
ar: الحجوزات

# bookings_all
source: All
ar: الكل

# bookings_pending
source: Pending
ar: قيد الانتظار

# bookings_confirmed
source: Confirmed
ar: تم التأكيد

# bookings_rejected
source: Rejected
ar: مرفوضة

# bookings_viewDetails
source: View Details
ar: عرض التفاصيل

# bookings_yourBooking
source: Your Booking
ar: حجزك

# bookings_noBookingsYet
source: No Bookings Yet
ar: لا توجد حجوزات بعد

# bookings_emptyMessage
source: You have no upcoming or past bookings. Time to plan your next adventure!
ar: ليس لديك أي حجوزات قادمة أو سابقة. حان الوقت لتخطيط مغامرتك القادمة!

# bookings_exploreStays
source: Explore Stays
ar: استكشف أماكن الإقامة

# listingDetails_title
source: Listing Details
ar: تفاصيل القائمة

# listingDetails_perNight
source: per night
ar: لليلة الواحدة

# listingDetails_hostedBy
source: Hosted by
ar: مستضيف بواسطة

# listingDetails_superHost
source: Super Host
ar: مضيف متميز

# listingDetails_reviews
source: Reviews
ar: التقييمات

# listingDetails_availability
source: Availability
ar: التوفر

# listingDetails_reserveNow
source: Reserve Now
ar: احجز الآن

# listingDetails_selectDatesFirst
source: Please select dates before booking
ar: يرجى تحديد التواريخ قبل الحجز

# listingDetails_bookingConfirmed
source: Booking confirmed! Check your bookings.
ar: تم تأكيد الحجز! تحقق من حجوزاتك.

# listingDetails_bookingPending
source: Your booking is pending
ar: حجزك قيد الانتظار

# listingDetails_daysAgo
source: {count} days ago
ar: قبل {count} يوم

# listingDetails_daysAgo_other
source: {count} days ago
ar: قبل {count} يوم

# editProfile_title
source: Edit Profile
ar: تعديل الملف الشخصي

# editProfile_changePhoto
source: Change Photo
ar: تغيير الصورة

# editProfile_fullName
source: Full Name
ar: الاسم الكامل

# editProfile_emailAddress
source: Email Address
ar: البريد الإلكتروني

# editProfile_phoneNumber
source: Profile Phone Number
ar: رقم الهاتف

# editProfile_location
source: Location
ar: الموقع

# editProfile_bio
source: Bio
ar: السيرة الذاتية

# editProfile_changePassword
source: Change Password
ar: تغيير كلمة المرور

# editProfile_notificationSettings
source: Notification Settings
ar: إعدادات الإشعارات

# editProfile_privacySettings
source: Privacy Settings
ar: إعدادات الخصوصية

# editProfile_deleteAccount
source: Delete Account
ar: حذف الحساب

# editProfile_profileUpdated
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

# editProfile_changeProfilePicture
source: Change Profile Picture
ar: تغيير صورة الملف الشخصي

# editProfile_chooseOption
source: Choose an option
ar: اختر خيارًا

# editProfile_camera
source: Camera
ar: الكاميرا

# editProfile_gallery
source: Gallery
ar: المعرض

# editProfile_deleteAccountTitle
source: Delete Account
ar: حذف الحساب

# editProfile_deleteAccountMessage
source: Are you sure you want to delete your account? This action cannot be undone and all your data will be permanently lost.
ar: هل أنت متأكد من أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء وستفقد جميع بياناتك بشكل دائم.

# bookingHistory_title
source: Booking History
ar: سجل الحجوزات

# bookingHistory_all
source: All
ar: الكل

# bookingHistory_upcoming
source: Upcoming
ar: القادمة

# bookingHistory_completed
source: Completed
ar: المكتملة

# bookingHistory_cancelled
source: Cancelled
ar: الملغاة

# notifications_title
source: Notifications
ar: الإشعارات

# notifications_new
source: New
ar: جديدة

# notifications_earlier
source: Earlier
ar: سابقة

# notifications_bookingConfirmed
source: Your booking is confirmed!
ar: تم تأكيد حجزك!

# notifications_bookingConfirmedMessage
source: You have successfully booked '{listing}' for {dates}.
ar: لقد حجزت '{listing}' بنجاح للفترة {dates}.

# notifications_shareExperience
source: Share your experience
ar: شارك تجربتك

# notifications_reviewRequest
source: Your stay at '{listing}' ended yesterday. How was it?
ar: أنهيت إقامتك في '{listing}' بالأمس. كيف كانت؟

# notifications_addReviewNow
source: Add Review Now
ar: أضف تقييمًا الآن

# notifications_hoursAgo
source: {count} hours ago
ar: قبل {count} ساعة

# notifications_hoursAgo_other
source: {count} hours ago
ar: قبل {count} ساعة

# notifications_daysAgo
source: {count} days ago
ar: قبل {count} يوم

# notifications_daysAgo_other
source: {count} days ago
ar: قبل {count} يوم

# notifications_rentalReminder
source: Your '{vehicle}' rental is starting in {days} days.
ar: تبدأ تأجير '{vehicle}' بعد {days} يوم.

# notifications_newSummerDeals
source: New summer deals!
ar: عروض الصيف الجديدة!

# notifications_promotionalMessage
source: Check out our new listings with up to 20% off.
ar: اطلع على قوائمنا الجديدة بخصم يصل إلى 20%.

# addReview_title
source: Add Review
ar: إضافة تقييم

# addReview_howWasStay
source: How was your stay?
ar: كيف كانت إقامتك؟

# addReview_shareExperience
source: Share your experience to help others
ar: شارك تجربتك لمساعدة الآخرين

# addReview_overallRating
source: Overall Rating
ar: التقييم العام

# addReview_tapToRate
source: Tap to rate
ar: انقر للتقييم

# addReview_stars
source: {rating}/5 Stars
ar: {rating}/5 نجوم

# addReview_quickReaction
source: Quick Reaction
ar: رد فعل سريع

# addReview_terrible
source: Terrible
ar: سيء

# addReview_poor
source: Poor
ar: ضعيف

# addReview_average
source: Average
ar: متوسط

# addReview_good
source: Good
ar: جيد

# addReview_excellent
source: Excellent
ar: ممتاز

# addReview_yourReview
source: Your Review
ar: تقييمك

# addReview_tellUsExperience
source: Tell us about your experience...
ar: أخبرنا عن تجربتك...

# addReview_charactersCount
source: {count}/300 characters
ar: {count}/300 حرف

# addReview_submitReview
source: Submit Review
ar: إرسال التقييم

# addReview_submitted
source: Review Submitted!
ar: تم إرسال التقييم!

# addReview_thankYouFeedback
source: Thank you for your feedback!
ar: شكرًا لك على ملاحظاتك!

# addReview_ok
source: OK
ar: موافق

# confirmListing_title
source: Confirm & Post
ar: تأكيد ونشر

# confirmListing_readyToPost
source: Ready to Post!
ar: جاهز للنشر!

# confirmListing_reviewDetails
source: Review your listing details before publishing
ar: راجع تفاصيل قائمتك قبل النشر

# confirmListing_pricingSummary
source: Pricing Summary
ar: ملخص الأسعار

# confirmListing_basePrice
source: Base Price
ar: السعر الأساسي

# confirmListing_serviceFee
source: Service Fee
ar: رسوم الخدمة

# confirmListing_totalAmount
source: Total Amount
ar: المبلغ الإجمالي

# confirmListing_premiumPlan
source: Premium Plan
ar: الخطة المميزة

# confirmListing_subscriptionDays
source: 30 days subscription
ar: اشتراك 30 يوم

# confirmListing_proTips
source: Pro Tips
ar: نصائح احترافية

# confirmListing_tip1
source: Add high-quality photos
ar: أضف صور عالية الجودة

# confirmListing_tip2
source: Highlight special offers
ar: سلط الضوء على العروض الخاصة

# confirmListing_tip3
source: Include contact information
ar: أضف معلومات الاتصال

# confirmListing_agreement
source: I agree to the Terms of Service and confirm all details are correct.
ar: أوافق على شروط الخدمة وأؤكد أن جميع التفاصيل صحيحة.

# confirmListing_postListing
source: Post Listing
ar: نشر القائمة

# confirmListing_listingPosted
source: Listing posted successfully!
ar: تم نشر القائمة بنجاح!

# blockUser_title
source: Block User
ar: حظر المستخدم

# blockUser_blockingSerious
source: Blocking is a serious action
ar: الحظر إجراء جاد

# blockUser_whatHappens
source: What happens when you block {userName}?
ar: ماذا يحدث عندما تحظر {userName}؟

# blockUser_consequence1
source: They won't be able to see your profile, posts, or stories
ar: لن يتمكن من رؤية ملفك الشخصي أو مشاركاتك أو قصصك

# blockUser_consequence2
source: They can't send you comments
ar: لا يمكنه إرسال تعليقات لك

# blockUser_consequence3
source: They won't be able to follow you or see your updates
ar: لن يتمكن من متابعتك أو رؤية تحديثاتك

# blockUser_consequence4
source: You won't receive any notifications from them
ar: لن تتلقى أي إشعارات منه

# blockUser_consequence5
source: They won't appear in your search results
ar: لن يظهر في نتائج البحث الخاصة بك

# blockUser_note
source: Note:
ar: ملاحظة:

# blockUser_noteMessage
source: If you change your mind, you can unblock this user anytime from your settings. Blocking is reversible and does not notify the other user.
ar: إذا غيرت رأيك، يمكنك إلغاء حظر هذا المستخدم في أي وقت من إعداداتك. الحظر قابل للعكس ولا يتم إخطار المستخدم الآخر.

# blockUser_blockUser
source: Block User
ar: حظر المستخدم

# blockUser_userBlocked
source: User Blocked
ar: تم حظر المستخدم

# blockUser_blockedSuccessfully
source: You have successfully blocked {userName}. This user will no longer be able to interact with you or view your profile.
ar: لقد حظرت {userName} بنجاح. لن يتمكن هذا المستخدم من التفاعل معك أو عرض ملفك الشخصي.

# blockUser_returnToHome
source: Return to Home
ar: العودة إلى الرئيسية

# blockedUsers_title
source: Blocked Users
ar: المستخدمون المحظورون

# blockedUsers_info
source: Blocked users cannot view your profile or contact you.
ar: لا يمكن للمستخدمين المحظورين عرض ملفك الشخصي أو الاتصال بك.

# blockedUsers_unblockUser
source: Unblock User?
ar: إلغاء حظر المستخدم؟

# blockedUsers_unblockConfirm
source: Are you sure you want to unblock {userName}? They will be able to interact with you and view your profile again.
ar: هل أنت متأكد من أنك تريد إلغاء حظر {userName}؟ سيكون قادرًا على التفاعل معك وعرض ملفك الشخصي مرة أخرى.

# blockedUsers_unblock
source: Unblock
ar: إلغاء الحظر

# blockedUsers_unblocked
source: {userName} has been unblocked
ar: تم إلغاء حظر {userName}

# blockedUsers_blocked
source: Blocked: {date}
ar: تم الحظر: {date}

# blockedUsers_noBlockedUsers
source: No Blocked Users
ar: لا يوجد مستخدمون محظورون

# blockedUsers_emptyMessage
source: Users you block will appear here. You can unblock them anytime if you change your mind.
ar: سيظهر المستخدمون الذين تحظرهم هنا. يمكنك إلغاء حظرهم في أي وقت إذا غيرت رأيك.

# listingHistory_title
source: My Listings
ar: قوائمي

# listingHistory_all
source: All
ar: الكل

# listingHistory_active
source: Active
ar: نشطة

# listingHistory_drafts
source: Draft
ar: مسودات

# listingHistory_noPostsFound
source: No Posts Found
ar: لم يتم العثور على مشاركات

# listingHistory_noPostsYet
source: You haven't created any posts yet.
ar: لم تقم بإنشاء أي مشاركات بعد.

# listingHistory_noFilterPosts
source: No {filter} posts found.
ar: لم يتم العثور على مشاركات {filter}.

# listingHistory_published
source: Published
ar: منشورة

# listingHistory_draft
source: Draft
ar: مسودة

# listingHistory_editPost
source: Edit Post
ar: تعديل المشاركة

# listingHistory_deletePost
source: Delete Post
ar: حذف المشاركة

# listingHistory_publish
source: Publish
ar: نشر

# listingHistory_archive
source: Archive
ar: أرشفة

# listingHistory_editing
source: Editing
ar: جارٍ التعديل

# listingHistory_deletePostTitle
source: Delete Post
ar: حذف المشاركة

# listingHistory_deletePostConfirm
source: Are you sure you want to delete "{title}"? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف "{title}"؟ لا يمكن التراجع عن هذا الإجراء.

# listingHistory_deleting
source: Deleting: {title}
ar: جاري الحذف: {title}

# listingHistory_postDeleted
source: Post deleted successfully
ar: تم حذف المشاركة بنجاح

# listingHistory_postPublished
source: Post published successfully
ar: تم نشر المشاركة بنجاح

# listingHistory_postArchived
source: Post archived
ar: تم أرشفة المشاركة

# reportUser_title
source: Report
ar: الإبلاغ

# reportUser_tellUsWrong
source: Tell us what's wrong
ar: أخبرنا ما الخطأ

# reportUser_inappropriateContent
source: Inappropriate content
ar: محتوى غير لائق

# reportUser_spamOrScam
source: Spam or scam
ar: بريد عشوائي أو احتيال

# reportUser_misleadingInfo
source: Misleading information
ar: معلومات مضللة

# reportUser_safetyConcern
source: Safety concern
ar: مخاوف أمنية

# reportUser_other
source: Other
ar: أخرى

# reportUser_additionalDetails
source: Additional Details (Optional)
ar: تفاصيل إضافية (اختياري)

# reportUser_provideMoreInfo
source: Provide more information
ar: تقديم المزيد من المعلومات

# reportUser_submitReport
source: Submit Report
ar: إرسال التقرير

# reportUser_selectReason
source: Please select a reason for reporting
ar: الرجاء تحديد سبب الإبلاغ

# reportUser_reportSubmitted
source: Report Submitted
ar: تم إرسال التقرير

# reportUser_thankYouReport
source: Thank you for your report. We will review it and take appropriate action if necessary.
ar: شكرًا لك على تقريرك. سنقوم بمراجعته واتخاذ الإجراء المناسب إذا لزم الأمر.

# reportUser_done
source: Done
ar: تم

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Edit
ar: تعديل

# forgotPassword_title
source: Forgot Password
ar: نسيت كلمة المرور

# forgotPassword_instructions
source: Enter your email to reset your password
ar: أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور

# forgotPassword_helpText
source: Check your spam folder if you don't receive the email within a few minutes.
ar: تحقق من مجلد الرسائل غير المرغوب فيها إذا لم تتلق البريد الإلكتروني خلال دقائق قليلة.

# forgotPassword_iconText
source: Don't worry! Just enter your email and we'll send you a reset link.
ar: لا تقلق! فقط أدخل بريدك الإلكتروني وسنرسل لك رابط إعادة التعيين.

# forgotPassword_emailLabel
source: Email
ar: البريد الإلكتروني

# forgotPassword_emailEmptyError
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# forgotPassword_emailInvalidError
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صحيح

# forgotPassword_resetLink
source: Reset link sent to your email
ar: تم إرسال رابط إعادة التعيين إلى بريدك الإلكتروني

# forgotPassword_sendButton
source: Send Reset Link
ar: إرسال رابط إعادة التعيين

# forgotPassword_backToLogin
source: Back to Login
ar: العودة إلى تسجيل الدخول

source: Search wilaya
ar: ابحث عن الولاية

source: Choose wilaya
ar: اختر الولاية

source: Enter price
ar: أدخل السعر

source: Enter max price
ar: أدخل السعر الأقصى

source: No wilaya found
ar: لا توجد ولايات

source: Enter
ar: أدخل

# dinars
source: DZD
ar: دج

# subscription_update_success
source: Your subscription has been updated successfully
ar: تم تحديث اشتراكك بنجاح

# bookings_cancel
source: Cancel
ar: إلغاء

# bookings_cancelBooking
source: Cancel Booking
ar: إلغاء الحجز

# bookings_cancelConfirmation
source: Are you sure you want to cancel this booking? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد إلغاء هذا الحجز؟ لا يمكن التراجع عن هذا الإجراء.

# bookings_canceledSuccessfully
source: Booking canceled successfully
ar: تم إلغاء الحجز بنجاح

# bookings_cancelationError
source: Failed to cancel booking. Please try again.
ar: فشل في إلغاء الحجز. يرجى المحاولة مرة أخرى.

# common_yes
source: Yes
ar: نعم

# common_no
source: No
ar: لا

# details_description
source: Description
ar: الوصف

# details_stayType
source: Stay Type
ar: نوع الإقامة

# details_bedrooms
source: Bedrooms
ar: غرف النوم

# details_area
source: Area
ar: المساحة

# details_vehicleType
source: Vehicle Type
ar: نوع المركبة

# details_model
source: Model
ar: الموديل

# details_year
source: Year
ar: السنة

# details_fuelType
source: Fuel Type
ar: نوع الوقود

# details_transmission
source: Transmission
ar: ناقل الحركة

# details_automatic
source: Automatic
ar: أوتوماتيكي

# details_manual
source: Manual
ar: يدوي

# details_seats
source: Seats
ar: المقاعد

# details_features
source: Features
ar: الميزات

# details_activityType
source: Activity Type
ar: نوع النشاط

# details_noAdditionalDetails
source: No additional details available
ar: لا توجد معلومات إضافية متاحة

# details_price
source: Price
ar: السعر

# details_available
source: Available
ar: متاح

# details_unavailable
source: Unavailable
ar: غير متاح

# details_pricePerNight
source: night
ar: ليلة

# details_pricePerDay
source: day
ar: يوم

# details_pricePerPerson
source: person
ar: شخص

# details_pricePerUnit
source: unit
ar: وحدة

source: No posts yet
ar: لا توجد مشاركات بعد

source: No matching posts
ar: لا توجد مشاركات مطابقة

# categorySelection_continue
source: Continue
ar: متابعة

# vehicleCategory_description
source: Rent cars, motorcycles, bicycles, or boats
ar: استئجار سيارات أو دراجات نارية أو دراجات هوائية أو قوارب
