Repository: mustafaots/Mobile-Dev-Project
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# stayCategory_description
source: Rent apartments, villas, rooms, or houses
ar: استئجار شقق أو فيلات أو غرف أو منازل

# activityCategory_description
source: Offer tours, workshops, adventures, or experiences
ar: تقديم جولات، ورشات، مغامرات أو تجارب

source: Choose Listing Category
ar: اختر فئة الإعلان

# select_type_of_listing
source: Select the type of listing you want to create
ar: اختر نوع الإعلان الذي تريد إنشاءه

source: Select Location
ar: اختر الموقع

# stay_details_title
source: Stay Details
ar: تفاصيل الإقامة

# stay_details_subtitle
source: Provide details about your stay
ar: قدّم تفاصيل حول مكان إقامتك

# rate_label
source: Rate
ar: السعر

# rate_error
source: Please select rate
ar: يرجى اختيار السعر

# stay_type_label
source: Stay Type
ar: نوع الإقامة

# stay_type_error
source: Please select stay type
ar: يرجى اختيار نوع الإقامة

# price_label
source: Price (DA)
ar: السعر (دج)

# price_error_required
source: Please enter price
ar: يرجى إدخال السعر

# price_error_invalid
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# area_label
source: Area (m²)
ar: المساحة (م²)

# area_error_required
source: Please enter area
ar: يرجى إدخال المساحة

# area_error_invalid
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# bedrooms_label
source: Number of Bedrooms
ar: عدد الغرف

# bedrooms_error_required
source: Please enter number of bedrooms
ar: يرجى إدخال عدد الغرف

# bedrooms_error_invalid
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# form_error_fill_all
source: Please fill all required fields correctly
ar: يرجى ملء جميع الحقول المطلوبة بشكل صحيح

# continue_button
source: Continue to Location
ar: المتابعة إلى الموقع

# vehicle_details_title
source: Vehicle Details
ar: تفاصيل المركبة

# vehicle_details_subtitle
source: Provide details about your vehicle
ar: قدّم تفاصيل حول مركبتك

# vehicle_type_label
source: Vehicle Type
ar: نوع المركبة

# vehicle_type_error
source: Please select vehicle type
ar: يرجى اختيار نوع المركبة

# model_label
source: Model
ar: الطراز

# model_error
source: Please enter model
ar: يرجى إدخال الطراز

# year_label
source: Year
ar: السنة

# year_error_empty
source: Please enter year
ar: يرجى إدخال السنة

# year_error_invalid
source: Please enter a valid year
ar: يرجى إدخال سنة صالحة

# year_error_range
source: Please enter a valid year (1900-{maxYear})
ar: يرجى إدخال سنة صالحة (1900–{maxYear})

# fuel_type_label
source: Fuel Type
ar: نوع الوقود

# fuel_type_error
source: Please select fuel type
ar: يرجى اختيار نوع الوقود

# transmission_label
source: Transmission
ar: ناقل الحركة

# transmission_manual
source: Manual
ar: يدوي

# transmission_automatic
source: Automatic
ar: أوتوماتيكي

# seats_label
source: Number of Seats
ar: عدد المقاعد

# seats_error_empty
source: Please enter number of seats
ar: يرجى إدخال عدد المقاعد

# seats_error_invalid
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# seats_error_range
source: Please enter valid number of seats (1-100)
ar: يرجى إدخال عدد مقاعد صالح (1-100)

# activity_details_title
source: Activity Details
ar: تفاصيل النشاط

# activity_details_subtitle
source: Provide details about your activity
ar: قدّم تفاصيل حول نشاطك

# activity_type_label
source: Activity Type
ar: نوع النشاط

# activity_type_error
source: Please select activity type
ar: يرجى اختيار نوع النشاط

# requirements_title
source: Requirements
ar: المتطلبات

source: Minimum Age
ar: الحد الأدنى للعمر

# minimum_age_error
source: Please enter minimum age
ar: يرجى إدخال الحد الأدنى للعمر

# valid_number_error
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# years_label
source: Years
ar: سنوات

source: Minimum age required
ar: العمر الأدنى المطلوب

# duration_label
source: Duration
ar: المدة

# duration_error
source: Please enter duration
ar: يرجى إدخال المدة

# hours_label
source: Hours
ar: ساعات

# duration_description
source: Activity duration in hours
ar: مدة النشاط بالساعات

# group_size_label
source: Maximum Group Size
ar: الحد الأقصى لحجم المجموعة

# group_size_error
source: Please enter group size
ar: يرجى إدخال حجم المجموعة

# persons_label
source: Persons
ar: أشخاص

# max_participants
source: Maximum participants allowed
ar: الحد الأقصى للمشاركين المسموح به

# additional_requirements
source: Additional Requirements (Optional)
ar: متطلبات إضافية (اختياري)

source: Requirement Name
ar: اسم المتطلب

# requirement_value
source: Value
ar: القيمة

# example_text
source: Example: "Insurance" = "Required", "Language" = "English"
ar: مثال: "التأمين" = "مطلوب"، "اللغة" = "الإنجليزية"

# equipment_label
source: Equipment
ar: المعدات

source: Select equipment
ar: اختر المعدات

# equipment_error
source: Please select equipment option
ar: يرجى اختيار خيار المعدات

# experience_label
source: Experience Level
ar: مستوى الخبرة

source: Select experience
ar: اختر مستوى الخبرة

# experience_error
source: Please select experience level
ar: يرجى اختيار مستوى الخبرة

# appbar_complete_listing
source: Complete Listing
ar: إكمال الإعلان

# header_complete_listing
source: Complete Your Listing
ar: أكمل إعلانك

# subtitle_complete_listing
source: Add location, photos, and availability
ar: أضف الموقع، الصور، والتوفر

# photos_section_title
source: Photos
ar: الصور

# photos_description
source: Add photos to make your listing more attractive
ar: أضف صورًا لجعل إعلانك أكثر جاذبية

# add_button
source: Add
ar: إضافة

# gallery_option
source: Choose from Gallery
ar: اختيار من المعرض

# camera_option
source: Take a Photo
ar: التقاط صورة

# select_location_button
source: Select Location on Map
ar: تحديد الموقع على الخريطة

# location_selected
source: Location Selected ({latitude}, {longitude})
ar: تم تحديد الموقع ({latitude}, {longitude})

# location_preview_not_selected
source: Select Location
ar: اختر الموقع

# location_preview_selected
source: Location Selected
ar: تم اختيار الموقع

# location_section
source: Location
ar: الموقع

# wilaya_label
source: Wilaya
ar: الولاية

# wilaya_validation
source: Please select wilaya
ar: يرجى اختيار الولاية

# city_label
source: City
ar: المدينة

# city_validation
source: Please enter city
ar: يرجى إدخال المدينة

# address_label
source: Address
ar: العنوان

# address_validation
source: Please enter address
ar: يرجى إدخال العنوان

# availability_section
source: Availability
ar: التوفر

# availability_description
source: Add time periods when your listing is available
ar: أضف الفترات الزمنية التي يكون فيها إعلانك متاحًا

# availability_empty
source: No availability periods added
ar: لم يتم إضافة أي فترات توفر

# availability_duration
source: Duration: {days} days
ar: المدة: {days} يومًا

# add_availability_button
source: Add Availability Period
ar: إضافة فترة توفر

# datepicker_help
source: Select availability period
ar: اختر فترة التوفر

# submit_button
source: Review and Submit
ar: مراجعة وإرسال

# form_validation_error
source: Please fill all required fields correctly
ar: يرجى تعبئة جميع الحقول المطلوبة بشكل صحيح

# time_validation_error
source: End time must be after start time
ar: يجب أن يكون وقت الانتهاء بعد وقت البدء

# home_screen_choose_type
source: choose type
ar: اختر النوع

# resetPasswordTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordSubtitle
source: Choose a strong password you haven’t used before.
ar: اختر كلمة مرور قوية لم تستخدمها من قبل.

# newPasswordLabel
source: New Password
ar: كلمة المرور الجديدة

# confirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# passwordEmptyError
source: Password cannot be empty
ar: لا يمكن أن تكون كلمة المرور فارغة

# passwordLengthError
source: Password must be at least 6 characters
ar: يجب أن تحتوي كلمة المرور على 6 أحرف على الأقل

# passwordMismatchError
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# resetPasswordButton
source: Reset Password
ar: إعادة تعيين كلمة المرور

# passwordUpdatedSuccess
source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح!

# resetPasswordFailed
source: Failed to reset password
ar: فشل في إعادة تعيين كلمة المرور

# securityRedirectHint
source: For security reasons, you’ll be redirected to login after updating your password.
ar: لأسباب أمنية، سيتم توجيهك إلى تسجيل الدخول بعد تحديث كلمة المرور.

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

# changePasswordSubtitle
source: Update your password to keep your account secure.
ar: قم بتحديث كلمة المرور للحفاظ على أمان حسابك.

# currentPasswordLabel
source: Current Password
ar: كلمة المرور الحالية

# currentPasswordRequiredError
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

# newPasswordRequiredError
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

# confirmNewPasswordLabel
source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# updatePasswordButton
source: Update Password
ar: تحديث كلمة المرور

# updatePasswordFailed
source: Failed to update password
ar: فشل في تحديث كلمة المرور

# reloginHint
source: After changing your password, you may be asked to log in again.
ar: بعد تغيير كلمة المرور، قد يُطلب منك تسجيل الدخول مرة أخرى.

# selectDate_title
source: Select Dates
ar: اختر التواريخ

# confirm_button
source: Confirm
ar: تأكيد

# updateReview_title
source: Edit Your Review
ar: تحديث تقييمك

# addReview_updated
source: Review Updated Successfully
ar: تم تحديث التقييم بنجاح

# reviewDeletedTitle
source: Review deleted
ar: تم حذف التقييم

# reviewDeletedMessage
source: Your review was deleted successfully.
ar: تم حذف تقييمك بنجاح.
